In [2]:
#Introduction to SQL

In [1]:
#SQL, which stands for Structured Query Language, is a language for interacting with data stored in something called a relational
#database.

#You can think of a relational database as a collection of tables. A table is just a set of rows and columns, like a spreadsheet, which
#represents exactly one type of entity. For example, a table might represent employees in a company or purchases made, but not both.

#Each row, or record, of a table contains information about a single entity. For example, in a table representing employees, each row
#represents a single person. Each column, or field, of a table contains a single attribute for all rows in the table. For example, in a
#table representing employees, we might have a column containing first and last names for all employees.

In [ ]:
#SELECTing single columns

In [ ]:
#In SQL, you can select data from a table using a SELECT statement. For example, the following query selects the name column from the
#people table:

#SELECT name
#FROM people;

In [ ]:
#SELECTing multiple columns

In [ ]:
#In the real world, you will often want to select multiple columns. Luckily, SQL makes this really easy. To select multiple columns from
#a table, simply separate the column names with commas!

#For example, this query selects two columns, name and birthdate, from the people table:

#SELECT name, birthdate
#FROM people;

In [ ]:
#SELECT DISTINCT

In [ ]:
#Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the
#DISTINCT keyword.

#This might be useful if, for example, you're interested in knowing which languages are represented in the films table:

#SELECT DISTINCT language
#FROM films;

In [ ]:
#Learning to COUNT

In [ ]:
#What if you want to count the number of employees in your employees table? The COUNT() function lets you do this by returning the number
#of rows in one or more columns.

#For example, this code gives the number of rows in the people table:

#SELECT COUNT(*)
#FROM people;

In [ ]:
#As you've seen, COUNT(*) tells you how many rows are in a table. However, if you want to count the number of non-missing values in a
#particular column, you can call COUNT() on just that column.

#For example, to count the number of birth dates present in the people table:

#SELECT COUNT(birthdate)
#FROM people;

In [ ]:
#Filtering Results
#In SQL, the WHERE keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison
#operators you can use:
#  = equal
#  <> not equal
#  < less than
#  > greater than
#  <= less than or equal to
#  >= greater than or equal to

In [ ]:
#Simple filtering of numeric values
#As you learned in the previous exercise, the WHERE clause can also be used to filter numeric records, such as years or ages.

In [ ]:
#Simple filtering of text
#Remember, the WHERE clause can also be used to filter text results, such as names or countries.

In [ ]:
#WHERE AND
#Often, you'll want to select data based on multiple conditions. You can build up your WHERE queries by combining multiple conditions 
#with the AND keyword.

In [ ]:
#WHERE AND OR
#What if you want to select rows based on multiple conditions where some but not all of the conditions need to be met? For this, SQL 
#has the OR operator.

In [ ]:
#WHERE AND OR (2)
#You now know how to select rows that meet some but not all conditions by combining AND and OR.

In [ ]:
#BETWEEN
#Checking for ranges like this is very common, so in SQL the BETWEEN keyword provides a useful shorthand for filtering values within a specified range. This query is equivalent to the one above:

In [ ]:
#BETWEEN (2)
#Similar to the WHERE clause, the BETWEEN clause can be used with multiple AND and OR operators, so you can build up your queries
#and make them even more powerful!
#For example, suppose we have a table called kids. We can get the names of all kids between the ages of 2 and 12 from the United States:

In [ ]:
#WHERE IN
#As you've seen, WHERE is very useful for filtering results. However, if you want to filter based on many conditions, WHERE can get unwieldy.

In [ ]:
#Introduction to NULL and IS NULL
#In SQL, NULL represents a missing or unknown value. You can check for NULL values using the expression IS NULL. For example, to 
#count the number of missing birth dates in the people table:

In [ ]:
#LIKE and NOT LIKE
#As you've seen, the WHERE clause can be used to filter text data. However, so far you've only been able to filter by specifying the 
#exact text you're interested in. In the real world, often you'll want to search for a pattern rather than a specific text string.
#In SQL, the LIKE operator can be used in a WHERE clause to search for a pattern in a column. To accomplish this, you use something
#called a wildcard as a placeholder for some other values. There are two wildcards you can use with LIKE:
#The % wildcard will match zero, one, or many characters in text. For example, the following query matches companies like 'Data', 
#'DataC' 'DataCamp', 'DataMind', and so on:

In [ ]:
#Aggregate functions
#Often, you will want to perform some calculation on the data in a database. SQL provides a few functions, called aggregate functions, 
#to help you out with this.

In [ ]:
#Combining aggregate functions with WHERE
#Aggregate functions can be combined with the WHERE clause to gain further insights from your data.
#For example, to get the total budget of movies made in the year 2010 or later:

In [ ]:
#A note on arithmetic
#In addition to using aggregate functions, you can perform basic arithmetic with symbols like +, -, *, and /.
#So, for example, this gives a result of 12:

In [ ]:
#It's AS simple AS aliasing
#You may have noticed in the first exercise of this chapter that the column name of your result was just the name of the function you used.

In [ ]:
#ORDER BY
#Congratulations on making it this far! You now know how to select and filter your results.
#In this chapter you'll learn how to sort and group your results to gain further insight. Let's go!
#In SQL, the ORDER BY keyword is used to sort results in ascending or descending order according to the values of one or more columns.
#By default ORDER BY will sort in ascending order. If you want to sort the results in descending order, you can use the DESC keyword. 
#For example,

In [ ]:
#Sorting single columns (DESC)
#To order results in descending order, you can put the keyword DESC after your ORDER BY. For example, to get all the names in the 
#people table, in reverse alphabetical order:

In [ ]:
#Sorting multiple columns
#ORDER BY can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next,
#and so on. For example,

In [ ]:
#GROUP BY
#Now you know how to sort results! Often you'll need to aggregate results. For example, you might want to count the number of male and 
#female employees in your company. Here, what you want is to group all the males together and count them, and group all the females 
#together and count them. In SQL, GROUP BY allows you to group a result by one or more columns,

In [ ]:
#GROUP BY practice
#As you've just seen, combining aggregate functions with GROUP BY can yield some powerful results!
#A word of warning: SQL will return an error if you try to SELECT a field that is not in your GROUP BY clause without using it to 
#calculate some kind of value about the entire group.
#Note that you can combine GROUP BY with ORDER BY to group your results, calculate something about them, and then order your results.

In [ ]:
#GROUP BY practice (2)
#Now practice your new skills by combining GROUP BY and ORDER BY with some more aggregate functions!
#Make sure to always put the ORDER BY clause at the end of your query. You can't sort values that you haven't calculated yet!

In [ ]:
#HAVING a great time
#In SQL, aggregate functions can't be used in WHERE clauses.